{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "dtype": "float32", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null}}]}}