{"config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 512, "batch_input_shape": [null, 784], "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "dtype": "float32", "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 256, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 128, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_4", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 32, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_5", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 16, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_6", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 10, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_7", "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}